In [24]:
from datascience import *
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# Creating Table

In [25]:
Table().with_columns('Number of petals', make_array(8, 34, 5))

Number of petals
8
34
5

In [26]:
# pandas 
pd.DataFrame([8,34,5], columns=['Number of petals'])

   Number of petals
0                 8
1                34
2                 5

In [27]:
pd.DataFrame({'Number of petals':[8,34,5]})

   Number of petals
0                 8
1                34
2                 5

In [28]:
d = {'Number of petals':[8,34,5]} #dictionary
pd.DataFrame(data=d)

   Number of petals
0                 8
1                34
2                 5

----------------

# Creating a table with two colums

In [29]:
Table().with_columns(
'Number of petals', make_array(8, 34, 5),
'Name', make_array('lotus', 's# Creating a table with two columsunflower', 'rose')
)

Number of petals | Name
8                | lotus
34               | s# Creating a table with two columsunflower
5                | rose

In [30]:
pd.DataFrame(data = [[8,'lotus'],[34,'sunflower'],[5,'rose']], 
columns=['Number of petals', 'Name'])

   Number of petals       Name
0                 8      lotus
1                34  sunflower
2                 5       rose

In [31]:
pd.DataFrame({'Number of petals':[8,34,5],
'Name':['lotus','sunflower','rose']})

   Number of petals       Name
0                 8      lotus
1                34  sunflower
2                 5       rose

----------------

# Adding a new column to an existing table

with_columns 는 저장하지 않으면 원본 데이터를 바꾸지 않는다

In [32]:
flowers = Table().with_columns(
'Number of petals', make_array(8, 34, 5),
'Name', make_array('lotus', 'sunflower', 'rose'))
flowers.with_columns(
'Color', make_array('pink', 'yellow', 'red'))

Number of petals | Name      | Color
8                | lotus     | pink
34               | sunflower | yellow
5                | rose      | red

In [33]:
flowers_df = pd.DataFrame({'Number of petals':[8,34,5], 
'Name':['lotus','sunflower','rose']})
flowers_df.insert(2, 'Color', ['pink','yellow','red'])
print(flowers_df)

   Number of petals       Name   Color
0                 8      lotus    pink
1                34  sunflower  yellow
2                 5       rose     red

In [34]:
flowers_df['Color'] = ['pink','yellow','red']
print(flowers)
print(flowers_df)

Number of petals | Name
8                | lotus
34               | sunflower
5                | rose
   Number of petals       Name   Color
0                 8      lotus    pink
1                34  sunflower  yellow
2                 5       rose     red

----------------

# Creating a Table from a CSV file

In [35]:
tbl = Table()
tbl = tbl.read_table('minard.csv')
tbl

Longitude | Latitude | City        | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

In [36]:
df_1 = pd.read_csv('minard.csv')
df_2 = pd.read_table('minard.csv',sep=',')
df_1.head(4) # tbl.show(4)

   Longitude  Latitude         City Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000

In [37]:
df_2

   Longitude  Latitude         City Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

----------------

# The Size of the Table

In [38]:
tbl.num_columns

5

In [39]:
tbl.num_rows

8

deep copy는 df_1에 변경이 발생해도, df에는 영향이 없음

In [40]:
df = df_1.copy(deep=True)
df.shape

(8, 5)

-------------

# Accessing column labels

In [41]:
tbl.labels

('Longitude', 'Latitude', 'City', 'Direction', 'Survivors')

In [42]:
df.columns

Index(['Longitude', 'Latitude', 'City', 'Direction', 'Survivors'], dtype='object')

---

# Replacing column labels

In [43]:
tbl = tbl.relabeled('City', 'City Name')
tbl

Longitude | Latitude | City Name   | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

inplace = true 는 새로 생성되는 데이터프레임을 원본데이터 프레임에 반영하겠다는 것

In [44]:
df.rename(columns={'City':'City Name'}, inplace = True)
df

   Longitude  Latitude    City Name Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

In [45]:
df = df.rename(columns={'City Name':'City Name'})
df

   Longitude  Latitude    City Name Direction  Survivors
0       32.0      54.8     Smolensk   Advance     145000
1       33.2      54.9  Dorogobouge   Advance     140000
2       34.4      55.5        Chjat   Advance     127100
3       37.6      55.8       Moscou   Advance     100000
4       34.3      55.2        Wixma   Retreat      55000
5       32.0      54.6     Smolensk   Retreat      24000
6       30.4      54.4       Orscha   Retreat      20000
7       26.8      54.3    Moiodexno   Retreat      12000

-----

# Accessing the Data in a Column

In [46]:
tbl.column('Survivors') # ndarray
tbl.column(4)

array([145000, 140000, 127100, 100000,  55000,  24000,  20000,  12000])

In [47]:
tbl.column(4).item(0)

145000

In [48]:
df['Survivors'] # Series
df.iloc[:, 4]

0    145000
1    140000
2    127100
3    100000
4     55000
5     24000
6     20000
7     12000
Name: Survivors, dtype: int64

In [49]:
df['Survivors'][0]

145000

In [50]:
df.iloc[0, 4]

145000

In [51]:
df.loc[2] # 2th row

Longitude       34.4
Latitude        55.5
City Name      Chjat
Direction    Advance
Survivors     127100
Name: 2, dtype: object

---------

# Choosing Sets of Columns

In [52]:
print(tbl)

Longitude | Latitude | City Name   | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

In [53]:
tbl.select('City Name', 'Survivors')
tbl.select(2,4)

City Name   | Survivors
Smolensk    | 145000
Dorogobouge | 140000
Chjat       | 127100
Moscou      | 100000
Wixma       | 55000
Smolensk    | 24000
Orscha      | 20000
Moiodexno   | 12000

In [54]:
df[['City Name','Survivors']]
df.iloc[:, [2,4]]

     City Name  Survivors
0     Smolensk     145000
1  Dorogobouge     140000
2        Chjat     127100
3       Moscou     100000
4        Wixma      55000
5     Smolensk      24000
6       Orscha      20000
7    Moiodexno      12000

-----------

# Working with the Data in a Column

In [55]:
initial = tbl.column('Survivors').item(0)
tbl = tbl.with_columns(
'Percent Surviving', tbl.column('Survivors')/initial
)
tbl

Longitude | Latitude | City Name   | Direction | Survivors | Percent Surviving
32        | 54.8     | Smolensk    | Advance   | 145000    | 1
33.2      | 54.9     | Dorogobouge | Advance   | 140000    | 0.965517
34.4      | 55.5     | Chjat       | Advance   | 127100    | 0.876552
37.6      | 55.8     | Moscou      | Advance   | 100000    | 0.689655
34.3      | 55.2     | Wixma       | Retreat   | 55000     | 0.37931
32        | 54.6     | Smolensk    | Retreat   | 24000     | 0.165517
30.4      | 54.4     | Orscha      | Retreat   | 20000     | 0.137931
26.8      | 54.3     | Moiodexno   | Retreat   | 12000     | 0.0827586

In [56]:
tbl.set_format('Percent Surviving', PercentFormatter)

Longitude | Latitude | City Name   | Direction | Survivors | Percent Surviving
32        | 54.8     | Smolensk    | Advance   | 145000    | 100.00%
33.2      | 54.9     | Dorogobouge | Advance   | 140000    | 96.55%
34.4      | 55.5     | Chjat       | Advance   | 127100    | 87.66%
37.6      | 55.8     | Moscou      | Advance   | 100000    | 68.97%
34.3      | 55.2     | Wixma       | Retreat   | 55000     | 37.93%
32        | 54.6     | Smolensk    | Retreat   | 24000     | 16.55%
30.4      | 54.4     | Orscha      | Retreat   | 20000     | 13.79%
26.8      | 54.3     | Moiodexno   | Retreat   | 12000     | 8.28%

판다스는 포맷을 바꾸는게 조금 복잡하다.

In [57]:
initial = df['Survivors'][0]
ratio = df['Survivors']/initial
percent = np.array(["{:.2%}".format(val) for val in ratio])
df['Percent Surviving'] = percent
df

   Longitude  Latitude    City Name Direction  Survivors Percent Surviving
0       32.0      54.8     Smolensk   Advance     145000           100.00%
1       33.2      54.9  Dorogobouge   Advance     140000            96.55%
2       34.4      55.5        Chjat   Advance     127100            87.66%
3       37.6      55.8       Moscou   Advance     100000            68.97%
4       34.3      55.2        Wixma   Retreat      55000            37.93%
5       32.0      54.6     Smolensk   Retreat      24000            16.55%
6       30.4      54.4       Orscha   Retreat      20000            13.79%
7       26.8      54.3    Moiodexno   Retreat      12000             8.28%

-------------

# Sorting Rows

In [58]:
nba_salaries = Table.read_table('nba_salaries2.csv')
nba_salaries.show(5)

In [59]:
nba = nba_salaries.relabeled("2015-2016 SALARY", 'SALARY')
nba.sort('SALARY')

PLAYER                 | POSITION | TEAM                 | SALARY
Thanasis Antetokounmpo | SF       | New York Knicks      | 0.030888
Jordan McRae           | SG       | Phoenix Suns         | 0.049709
Cory Jefferson         | PF       | Phoenix Suns         | 0.049709
Elliot Williams        | SG       | Memphis Grizzlies    | 0.055722
Orlando Johnson        | SG       | Phoenix Suns         | 0.055722
Phil Pressey           | PG       | Phoenix Suns         | 0.055722
Keith Appling          | PG       | Orlando Magic        | 0.061776
Sean Kilpatrick        | SG       | Denver Nuggets       | 0.099418
Erick Green            | PG       | Utah Jazz            | 0.099418
Jeff Ayres             | PF       | Los Angeles Clippers | 0.111444
... (407 rows omitted)

In [60]:
nba.sort('SALARY', descending=True)

PLAYER          | POSITION | TEAM                  | SALARY
Kobe Bryant     | SF       | Los Angeles Lakers    | 25
Joe Johnson     | SF       | Brooklyn Nets         | 24.8949
LeBron James    | SF       | Cleveland Cavaliers   | 22.9705
Carmelo Anthony | SF       | New York Knicks       | 22.875
Dwight Howard   | C        | Houston Rockets       | 22.3594
Chris Bosh      | PF       | Miami Heat            | 22.1927
Chris Paul      | PG       | Los Angeles Clippers  | 21.4687
Kevin Durant    | SF       | Oklahoma City Thunder | 20.1586
Derrick Rose    | PG       | Chicago Bulls         | 20.0931
Dwyane Wade     | SG       | Miami Heat            | 20
... (407 rows omitted)

In [61]:
help(Table.sort)

Help on function sort in module datascience.tables:

sort(self, column_or_label, descending=False, distinct=False)
    Return a Table of rows sorted according to the values in a column.

    Args:
        ``column_or_label``: the column whose values are used for sorting.

        ``descending``: if True, sorting will be in descending, rather than
            ascending order.

        ``distinct``: if True, repeated values in ``column_or_label`` will
            be omitted.

    Returns:
        An instance of ``Table`` containing rows sorted based on the values
        in ``column_or_label``.

    >>> marbles = Table().with_columns(
    ...    "Color", make_array("Red", "Green", "Blue", "Red", "Green", "Green"),
    ...    "Shape", make_array("Round", "Rectangular", "Rectangular", "Round", "Rectangular", "Round"),
    ...    "Amount", make_array(4, 6, 12, 7, 9, 2),
    ...    "Price", make_array(1.30, 1.30, 2.00, 1.75, 1.40, 1.00))
    >>> marbles
    Color | Shape       | Amount | Price
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 6      | 1.3
    Blue  | Rectangular | 12     | 2
    Red   | Round       | 7      | 1.75
    Green | Rectangular | 9      | 1.4
    Green | Round       | 2      | 1
    >>> marbles.sort("Amount")
    Color | Shape       | Amount | Price
    Green | Round       | 2      | 1
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 6      | 1.3
    Red   | Round       | 7      | 1.75
    Green | Rectangular | 9      | 1.4
    Blue  | Rectangular | 12     | 2
    >>> marbles.sort("Amount", descending = True)
    Color | Shape       | Amount | Price
    Blue  | Rectangular | 12     | 2
    Green | Rectangular | 9      | 1.4
    Red   | Round       | 7      | 1.75
    Green | Rectangular | 6      | 1.3
    Red   | Round       | 4      | 1.3
    Green | Round       | 2      | 1
    >>> marbles.sort(3) # the Price column
    Color | Shape       | Amount | Price
    Green | Round       | 2      | 1
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 6      | 1.3
    Green | Rectangular | 9      | 1.4
    Red   | Round       | 7      | 1.75
    Blue  | Rectangular | 12     | 2
    >>> marbles.sort(3, distinct = True)
    Color | Shape       | Amount | Price
    Green | Round       | 2      | 1
    Red   | Round       | 4      | 1.3
    Green | Rectangular | 9      | 1.4
    Red   | Round       | 7      | 1.75
    Blue  | Rectangular | 12     | 2

In [62]:
df_nba = pd.read_csv('nba_salaries2.csv')
df_nba = df_nba.rename(columns={'2015-2016 SALARY':'SALARY'})
df_nba.sort_values(by = ['SALARY'], axis=0, ascending=False).head(5) 
# or [:5]

              PLAYER POSITION                 TEAM     SALARY
169      Kobe Bryant       SF   Los Angeles Lakers  25.000000
29       Joe Johnson       SF        Brooklyn Nets  24.894863
72      LeBron James       SF  Cleveland Cavaliers  22.970500
255  Carmelo Anthony       SF      New York Knicks  22.875000
131    Dwight Howard        C      Houston Rockets  22.359364

------------

# Selecting Rows

In [63]:
nba

PLAYER           | POSITION | TEAM          | SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [64]:
nba.take(np.arange(3, 6))

PLAYER          | POSITION | TEAM          | SALARY
Jeff Teague     | PG       | Atlanta Hawks | 8
Kyle Korver     | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha | SF       | Atlanta Hawks | 4

In [65]:
df_nba

              PLAYER POSITION                TEAM     SALARY
0       Paul Millsap       PF       Atlanta Hawks  18.671659
1         Al Horford        C       Atlanta Hawks  12.000000
2     Tiago Splitter        C       Atlanta Hawks   9.756250
3        Jeff Teague       PG       Atlanta Hawks   8.000000
4        Kyle Korver       SG       Atlanta Hawks   5.746479
..               ...      ...                 ...        ...
412        Gary Neal       PG  Washington Wizards   2.139000
413     DeJuan Blair        C  Washington Wizards   2.000000
414  Kelly Oubre Jr.       SF  Washington Wizards   1.920240
415   Garrett Temple       SG  Washington Wizards   1.100602
416     Jarell Eddie       SG  Washington Wizards   0.561716

[417 rows x 4 columns]

In [66]:
df_nba[3:6]

            PLAYER POSITION           TEAM    SALARY
3      Jeff Teague       PG  Atlanta Hawks  8.000000
4      Kyle Korver       SG  Atlanta Hawks  5.746479
5  Thabo Sefolosha       SF  Atlanta Hawks  4.000000

In [67]:
nba.where('SALARY', are.above(10)).sort('SALARY', True)

PLAYER          | POSITION | TEAM                  | SALARY
Kobe Bryant     | SF       | Los Angeles Lakers    | 25
Joe Johnson     | SF       | Brooklyn Nets         | 24.8949
LeBron James    | SF       | Cleveland Cavaliers   | 22.9705
Carmelo Anthony | SF       | New York Knicks       | 22.875
Dwight Howard   | C        | Houston Rockets       | 22.3594
Chris Bosh      | PF       | Miami Heat            | 22.1927
Chris Paul      | PG       | Los Angeles Clippers  | 21.4687
Kevin Durant    | SF       | Oklahoma City Thunder | 20.1586
Derrick Rose    | PG       | Chicago Bulls         | 20.0931
Dwyane Wade     | SG       | Miami Heat            | 20
... (59 rows omitted)

In [68]:
df_nba[df_nba['SALARY']>10].sort_values(by=['SALARY'], ascending=False)

              PLAYER POSITION                 TEAM     SALARY
169      Kobe Bryant       SF   Los Angeles Lakers  25.000000
29       Joe Johnson       SF        Brooklyn Nets  24.894863
72      LeBron James       SF  Cleveland Cavaliers  22.970500
255  Carmelo Anthony       SF      New York Knicks  22.875000
131    Dwight Howard        C      Houston Rockets  22.359364
..               ...      ...                  ...        ...
95   Wilson Chandler       SF       Denver Nuggets  10.449438
144      Monta Ellis       SG       Indiana Pacers  10.300000
204        Luol Deng       SF           Miami Heat  10.151612
298   Gerald Wallace       SF   Philadelphia 76ers  10.105855
368    DeMar DeRozan       SG      Toronto Raptors  10.050000

[69 rows x 4 columns]

In [69]:
# get the team name
team_name = nba.where('PLAYER',are.equal_to('Stephen Curry')).column('TEAM').item(0)
team_name

'Golden State Warriors'

In [70]:
# extract players
nba.where('TEAM', are.equal_to(team_name)).show()

In [71]:
# equivalent to nba.where('TEAM', are.equal_to('Denver Nuggets'))
nba.where('TEAM', 'Denver Nuggets')

PLAYER            | POSITION | TEAM           | SALARY
Danilo Gallinari  | SF       | Denver Nuggets | 14
Kenneth Faried    | PF       | Denver Nuggets | 11.236
Wilson Chandler   | SF       | Denver Nuggets | 10.4494
JJ Hickson        | C        | Denver Nuggets | 5.6135
Jameer Nelson     | PG       | Denver Nuggets | 4.345
Will Barton       | SF       | Denver Nuggets | 3.53333
Emmanuel Mudiay   | PG       | Denver Nuggets | 3.10224
Darrell Arthur    | PF       | Denver Nuggets | 2.814
Jusuf Nurkic      | C        | Denver Nuggets | 1.842
Joffrey Lauvergne | C        | Denver Nuggets | 1.70972
... (4 rows omitted)

In [73]:
team_name = df_nba[df_nba['PLAYER']=='Stephen Curry']['TEAM'].iloc[0]
team_name

'Golden State Warriors'

In [74]:
df_nba[df_nba['TEAM']==team_name]

                PLAYER POSITION                   TEAM     SALARY
117      Klay Thompson       SG  Golden State Warriors  15.501000
118     Draymond Green       PF  Golden State Warriors  14.260870
119       Andrew Bogut        C  Golden State Warriors  13.800000
120     Andre Iguodala       SF  Golden State Warriors  11.710456
121      Stephen Curry       PG  Golden State Warriors  11.370786
122     Jason Thompson       PF  Golden State Warriors   7.008475
123   Shaun Livingston       PG  Golden State Warriors   5.543725
124    Harrison Barnes       SF  Golden State Warriors   3.873398
125  Marreese Speights        C  Golden State Warriors   3.815000
126    Leandro Barbosa       SG  Golden State Warriors   2.500000
127       Festus Ezeli        C  Golden State Warriors   2.008748
128       Brandon Rush       SF  Golden State Warriors   1.270964
129       Kevon Looney       SF  Golden State Warriors   1.131960
130   Anderson Varejao       PF  Golden State Warriors   0.289755

In [75]:
nba.where('POSITION','PG').where('SALARY', are.between(10,12))

PLAYER        | POSITION | TEAM                  | SALARY
Stephen Curry | PG       | Golden State Warriors | 11.3708
Jrue Holiday  | PG       | New Orleans Pelicans  | 10.5955

In [76]:
df_nba[(df_nba['POSITION']=='PG') & (10<=df_nba['SALARY']) & (df_nba['SALARY']<12)]

            PLAYER POSITION                   TEAM     SALARY
121  Stephen Curry       PG  Golden State Warriors  11.370786
241   Jrue Holiday       PG   New Orleans Pelicans  10.595507

In [77]:
nba.where('PLAYER', are.equal_to('Barack Obama'))

PLAYER | POSITION | TEAM | SALARY

In [78]:
nba.where('TEAM', are.containing('Warriors')).show()

In [79]:
df_nba[df_nba['TEAM'].str.contains('Warriors')]

                PLAYER POSITION                   TEAM     SALARY
117      Klay Thompson       SG  Golden State Warriors  15.501000
118     Draymond Green       PF  Golden State Warriors  14.260870
119       Andrew Bogut        C  Golden State Warriors  13.800000
120     Andre Iguodala       SF  Golden State Warriors  11.710456
121      Stephen Curry       PG  Golden State Warriors  11.370786
122     Jason Thompson       PF  Golden State Warriors   7.008475
123   Shaun Livingston       PG  Golden State Warriors   5.543725
124    Harrison Barnes       SF  Golden State Warriors   3.873398
125  Marreese Speights        C  Golden State Warriors   3.815000
126    Leandro Barbosa       SG  Golden State Warriors   2.500000
127       Festus Ezeli        C  Golden State Warriors   2.008748
128       Brandon Rush       SF  Golden State Warriors   1.270964
129       Kevon Looney       SF  Golden State Warriors   1.131960
130   Anderson Varejao       PF  Golden State Warriors   0.289755